weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_HTTP.c
/**
 ******************************************************************************
 * @file    STM32_WifiESP_HTTP.c
 * @author  manu
 * @version 1.2.0
 * @date    17 juin 2025
 * @brief   Fonctions HTTP haut niveau pour ESP01 (serveur, requêtes, parsing, routes)
 *
 * @details
 * Ce fichier source contient l’implémentation des fonctions HTTP haut niveau pour le module ESP01 :
 * - Gestion du serveur HTTP intégré (démarrage, arrêt, configuration)
 * - Parsing des requêtes HTTP reçues via +IPD
 * - Routage des requêtes HTTP vers des handlers personnalisés
 * - Envoi de réponses HTTP (HTML, JSON, 404, etc.)
 * - Gestion des connexions TCP entrantes (suivi, fermeture, nettoyage)
 * - Statistiques d’utilisation HTTP
 *
 * @note
 * - Compatible STM32CubeIDE.
 * - Nécessite la bibliothèque STM32_WifiESP.h.
 * - Nécessite le fichier STM32_WifiESP_WIFI.h pour les fonctions WiFi.
 *
 * @copyright
 * La licence de ce code est libre.
 ******************************************************************************
 */

// ==================== INCLUDES ====================

#include "STM32_WifiESP.h"      // Inclusion du header principal du driver ESP01
#include "STM32_WifiESP_WIFI.h" // Inclusion du header pour la gestion WiFi
#include "STM32_WifiESP_HTTP.h" // Inclusion du header HTTP (déclarations des structures et fonctions)
#include <string.h>             // Pour les fonctions de manipulation de chaînes (memcpy, memset, etc.)
#include <stdio.h>              // Pour les fonctions d'entrée/sortie (snprintf, sscanf, etc.)
#include <stdbool.h>            // Pour le type booléen

// ==================== DEFINES ====================
#define ESP01_CONN_TIMEOUT_MS 30000 ///< Timeout de connexion TCP (ms)

// ==================== VARIABLES GLOBALES ====================
connection_info_t g_connections[ESP01_MAX_CONNECTIONS] = {0}; // Tableau des connexions TCP actives
int g_connection_count = ESP01_MAX_CONNECTIONS;               // Nombre maximal de connexions
volatile int g_acc_len = 0;                                   // Longueur courante de l'accumulateur HTTP
char g_accumulator[ESP01_MAX_TOTAL_HTTP] = {0};               // Buffer accumulateur pour les données HTTP reçues
volatile int g_processing_request = 0;                        // Indicateur de traitement en cours d'une requête HTTP
esp01_route_t g_routes[ESP01_MAX_ROUTES] = {0};               // Tableau des routes HTTP enregistrées
int g_route_count = 0;                                        // Nombre de routes HTTP enregistrées
esp01_stats_t g_stats = {0};                                  // Statistiques HTTP globales
extern uint16_t g_server_port;                                // Port du serveur HTTP

// ==================== OUTILS FACTORISÉS ====================

/**
 * @brief Recherche le prochain paquet +IPD dans le buffer.
 * @param buffer      Buffer à analyser.
 * @param buffer_len  Taille du buffer.
 * @retval Pointeur vers le début du +IPD, ou NULL si non trouvé.
 */
static char *_find_next_ipd(char *buffer, int buffer_len)
{
    for (int i = 0; i < buffer_len - 4; ++i)     // Parcours le buffer jusqu'à buffer_len-4
        if (memcmp(&buffer[i], "+IPD,", 5) == 0) // Compare les 5 caractères avec "+IPD,"
            return &buffer[i];                   // Retourne le pointeur si trouvé
    return NULL;                                 // Retourne NULL si non trouvé
}

/**
 * @brief Parse l'en-tête +IPD pour extraire les infos de la requête.
 * @param data  Chaîne brute commençant par +IPD.
 * @retval Structure http_request_t remplie.
 */
static http_request_t parse_ipd_header(const char *data)
{
    http_request_t req = {0};                    // Initialise la structure à zéro
    if (!data || strncmp(data, "+IPD,", 5) != 0) // Vérifie que la chaîne commence bien par "+IPD,"
        return req;                              // Retourne une structure vide si ce n'est pas le cas

    int conn_id = -1, content_length = 0, client_port = 0; // Variables pour stocker les valeurs extraites
    char client_ip[ESP01_MAX_IP_LEN] = {0};                // Buffer pour l'adresse IP du client

    int n = sscanf(data, "+IPD,%d,%d,\"%[^\"]\",%d:", &conn_id, &content_length, client_ip, &client_port); // Tente de parser la version longue avec IP et port
    if (n == 4)                                                                                            // Si les 4 champs sont trouvés
    {
        req.conn_id = conn_id;                                              // Stocke l'identifiant de connexion
        req.content_length = content_length;                                // Stocke la longueur du contenu
        req.has_ip = true;                                                  // Indique que l'IP est présente
        esp01_safe_strcpy(req.client_ip, sizeof(req.client_ip), client_ip); // Copie l'adresse IP
        req.client_port = client_port;                                      // Stocke le port du client
        req.is_valid = true;                                                // Indique que la structure est valide
    }
    else if (sscanf(data, "+IPD,%d,%d:", &conn_id, &content_length) == 2) // Sinon, tente la version courte sans IP
    {
        req.conn_id = conn_id;               // Stocke l'identifiant de connexion
        req.content_length = content_length; // Stocke la longueur du contenu
        req.has_ip = false;                  // Indique que l'IP n'est pas présente
        req.client_ip[0] = '\0';             // Chaîne IP vide
        req.client_port = 0;                 // Port à zéro
        req.is_valid = true;                 // Indique que la structure est valide
    }
    return req; // Retourne la structure remplie
}

// ==================== ROUTES ====================

/**
 * @brief Efface toutes les routes HTTP enregistrées.
 */
void esp01_clear_routes(void)
{
    ESP01_LOG_DEBUG("HTTP", "Effacement de toutes les routes HTTP"); // Log l'effacement des routes
    memset(g_routes, 0, sizeof(g_routes));                           // Réinitialise le tableau des routes à zéro
    g_route_count = 0;                                               // Réinitialise le compteur de routes
}

/**
 * @brief Ajoute une route HTTP et son handler.
 * @param path     Chemin de la route (ex: "/status").
 * @param handler  Fonction handler associée.
 * @retval ESP01_Status_t Code de statut.
 */
ESP01_Status_t esp01_add_route(const char *path, esp01_route_handler_t handler)
{
    ESP01_LOG_DEBUG("HTTP", "Ajout de la route : %s", path);                        // Log l'ajout de la route
    VALIDATE_PARAM(path && handler, ESP01_INVALID_PARAM);                           // Vérifie les paramètres
    if (g_route_count >= ESP01_MAX_ROUTES)                                          // Vérifie qu'il reste de la place
        ESP01_RETURN_ERROR("ADD_ROUTE", ESP01_FAIL);                                // Retourne une erreur si trop de routes
    esp01_safe_strcpy(g_routes[g_route_count].path, ESP01_MAX_HTTP_PATH_LEN, path); // Copie le chemin de la route
    g_routes[g_route_count].handler = handler;                                      // Associe le handler
    g_route_count++;                                                                // Incrémente le compteur de routes
    ESP01_LOG_DEBUG("HTTP", "Route ajoutée : %s (total=%d)", path, g_route_count);  // Log la réussite
    return ESP01_OK;                                                                // Retourne OK
}

/**
 * @brief Supprime une route HTTP enregistrée.
 * @param path  Chemin de la route à supprimer (ex: "/status").
 * @retval ESP01_Status_t Code de statut.
 */
ESP01_Status_t esp01_remove_route(const char *path)
{
    VALIDATE_PARAM(path, ESP01_INVALID_PARAM);                     // Vérifie le paramètre
    ESP01_LOG_DEBUG("HTTP", "Suppression de la route : %s", path); // Log la suppression de la route

    for (int i = 0; i < g_route_count; ++i) // Parcours les routes enregistrées
    {
        if (strcmp(g_routes[i].path, path) == 0) // Si la route correspondante est trouvée
        {
            // Décale les routes suivantes vers le haut
            memmove(&g_routes[i], &g_routes[i + 1], (g_route_count - i - 1) * sizeof(esp01_route_t));
            g_route_count--;                                                                 // Décrémente le compteur de routes
            ESP01_LOG_DEBUG("HTTP", "Route supprimée : %s (total=%d)", path, g_route_count); // Log la réussite
            return ESP01_OK;                                                                 // Retourne OK
        }
    }

