weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_HTTP.c
    ESP01_LOG_WARN("HTTP", "Route non trouvée pour suppression : %s", path); // Log un avertissement si la route n'est pas trouvée
    return ESP01_FAIL;                                                       // Retourne une erreur
}

/**
 * @brief Recherche le handler associé à une route HTTP.
 * @param path  Chemin de la route recherchée.
 * @retval Pointeur vers le handler, ou NULL si non trouvé.
 */
esp01_route_handler_t esp01_find_route_handler(const char *path)
{
    ESP01_LOG_DEBUG("HTTP", "Recherche du handler pour la route : %s", path); // Log la recherche
    for (int i = 0; i < g_route_count; ++i)                                   // Parcours toutes les routes enregistrées
        if (strncmp(path, g_routes[i].path, ESP01_MAX_HTTP_PATH_LEN) == 0)    // Compare le chemin
            return g_routes[i].handler;                                       // Retourne le handler si trouvé
    ESP01_LOG_DEBUG("HTTP", "Aucun handler trouvé pour la route : %s", path); // Log si non trouvé
    return NULL;                                                              // Retourne NULL si aucun handler trouvé
}

// ==================== INIT & SERVEUR ====================

/**
 * @brief Initialise le module HTTP (routes, connexions, accumulateur).
 * @retval ESP01_Status_t Code de statut.
 */
ESP01_Status_t esp01_http_init(void)
{
    ESP01_LOG_DEBUG("HTTP", "Initialisation du module HTTP"); // Log l'initialisation
    memset(g_connections, 0, sizeof(g_connections));          // Réinitialise les connexions
    g_connection_count = ESP01_MAX_CONNECTIONS;               // Réinitialise le compteur de connexions
    g_acc_len = 0;                                            // Réinitialise la longueur de l'accumulateur
    memset(g_accumulator, 0, sizeof(g_accumulator));          // Vide l'accumulateur
    g_processing_request = 0;                                 // Réinitialise l'indicateur de traitement
    esp01_clear_routes();                                     // Efface toutes les routes HTTP
    return ESP01_OK;                                          // Retourne OK
}

/**
 * @brief Démarre le serveur HTTP sur le port spécifié.
 * @param port  Port TCP à ouvrir.
 * @retval ESP01_Status_t Code de statut.
 */
ESP01_Status_t esp01_http_start_server(uint16_t port)
{
    ESP01_LOG_DEBUG("HTTP", "Démarrage du serveur HTTP sur le port %u", port);                          // Log le démarrage du serveur
    char cmd[ESP01_MAX_CMD_BUF];                                                                        // Buffer pour la commande AT
    snprintf(cmd, sizeof(cmd), "AT+CIPSERVER=1,%u", port);                                              // Prépare la commande AT pour démarrer le serveur
    char resp[ESP01_MAX_RESP_BUF];                                                                      // Buffer pour la réponse AT
    ESP01_Status_t st = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", ESP01_TIMEOUT_SHORT); // Envoie la commande AT
    if (st != ESP01_OK)                                                                                 // Vérifie le statut de la commande
        ESP01_RETURN_ERROR("HTTP_SERVER", st);                                                          // Retourne une erreur si échec
    ESP01_LOG_INFO("HTTP", "Serveur HTTP démarré sur le port %u", port);                                // Log la réussite
    g_server_port = port;                                                                               // Enregistre le port du serveur dans la variable globale
    return ESP01_OK;                                                                                    // Retourne OK
}

/**
 * @brief Arrête le serveur HTTP.
 * @retval ESP01_Status_t Code de statut.
 */
ESP01_Status_t esp01_http_stop_server(void)
{
    ESP01_LOG_DEBUG("HTTP", "Arrêt du serveur HTTP");                                                                // Log l'arrêt du serveur
    char resp[ESP01_MAX_RESP_BUF];                                                                                   // Buffer pour la réponse AT
    ESP01_Status_t st = esp01_send_raw_command_dma("AT+CIPSERVER=0", resp, sizeof(resp), "OK", ESP01_TIMEOUT_SHORT); // Envoie la commande AT pour arrêter le serveur
    if (st != ESP01_OK)                                                                                              // Vérifie le statut de la commande
        ESP01_RETURN_ERROR("HTTP_STOP", st);                                                                         // Retourne une erreur si échec
    ESP01_LOG_INFO("HTTP", "Serveur HTTP arrêté");                                                                   // Log la réussite
    return ESP01_OK;                                                                                                 // Retourne OK
}

/**
 * @brief Configure le serveur HTTP (mode multi-connexion, port, IPDINFO).
 * @param multi_conn  true pour activer le multi-connexion.
 * @param port        Port TCP à ouvrir.
 * @param ipdinfo     true pour activer l'affichage IP/port client.
 * @retval ESP01_Status_t Code de statut.
 */
ESP01_Status_t esp01_start_server_config(bool multi_conn, uint16_t port, bool ipdinfo)
{
    ESP01_LOG_DEBUG("HTTP", "Configuration du serveur : multi_conn=%d, port=%u, ipdinfo=%d", multi_conn, port, ipdinfo); // Log la configuration
    ESP01_Status_t st = ESP01_OK;                                                                                        // Statut de retour
    char resp[ESP01_MAX_RESP_BUF];                                                                                       // Buffer pour la réponse AT

    if (multi_conn) // Si le mode multi-connexion est demandé
    {
        st = esp01_send_raw_command_dma("AT+CIPMUX=1", resp, sizeof(resp), "OK", ESP01_TIMEOUT_SHORT); // Active le multi-connexion
        if (st != ESP01_OK)                                                                            // Vérifie le statut
            ESP01_RETURN_ERROR("CIPMUX", st);                                                          // Retourne une erreur si échec
    }

    if (ipdinfo) // Si l'affichage IP/port client est demandé
    {
        st = esp01_send_raw_command_dma("AT+CIPDINFO=1", resp, sizeof(resp), "OK", ESP01_TIMEOUT_SHORT); // Active l'affichage IP/port
        if (st != ESP01_OK)                                                                              // Vérifie le statut
            ESP01_RETURN_ERROR("CIPDINFO", st);                                                          // Retourne une erreur si échec
    }

    return esp01_http_start_server(port); // Démarre le serveur HTTP sur le port spécifié
}

// ==================== PARSING REQUÊTES HTTP ====================

/**
 * @brief Parse une requête HTTP brute en structure http_parsed_request_t.
 * @param raw_request  Chaîne brute de la requête HTTP.
 * @param parsed       Pointeur vers la structure de sortie.
 * @retval ESP01_Status_t Code de statut.
 */
ESP01_Status_t esp01_parse_http_request(const char *raw_request, http_parsed_request_t *parsed)
{
    ESP01_LOG_DEBUG("HTTP", "Parsing de la requête HTTP...");
    VALIDATE_PARAM(raw_request, ESP01_INVALID_PARAM);
    VALIDATE_PARAM(parsed, ESP01_INVALID_PARAM);

    memset(parsed, 0, sizeof(http_parsed_request_t));

    const char *p = raw_request;
    const char *method_start = p, *method_end = NULL;
    const char *path_start = NULL, *path_end = NULL;
    const char *query_start = NULL, *query_end = NULL;
    const char *line_end = strstr(p, "\r\n");
    if (!line_end)
    {
        ESP01_RETURN_ERROR("HTTP_PARSE", ESP01_PARSE_ERROR);
    }

    while (p < line_end && *p != ' ') // Avance jusqu'à l'espace après la méthode
        p++;
    method_end = p;                                                  // Marque la fin de la méthode
    if (method_end - method_start >= ESP01_MAX_HTTP_METHOD_LEN)      // Vérifie la taille de la méthode
        return ESP01_FAIL;                                           // Retourne une erreur si trop long
    memcpy(parsed->method, method_start, method_end - method_start); // Copie la méthode
    parsed->method[method_end - method_start] = '\0';                // Termine la chaîne

    p++;                                           // Passe l'espace
    path_start = p;                                // Début du chemin
    while (p < line_end && *p != ' ' && *p != '?') // Avance jusqu'à l'espace ou '?'
        p++;
    path_end = p;                                            // Fin du chemin
    if (path_end - path_start >= ESP01_MAX_HTTP_PATH_LEN)    // Vérifie la taille du chemin
        return ESP01_FAIL;                                   // Retourne une erreur si trop long
    memcpy(parsed->path, path_start, path_end - path_start); // Copie le chemin
    parsed->path[path_end - path_start] = '\0';              // Termine la chaîne

    if (*p == '?') // Si une query string est présente
    {
        p++;                              // Passe le '?'
        query_start = p;                  // Début de la query string
        while (p < line_end && *p != ' ') // Avance jusqu'à l'espace
            p++;
        query_end = p;                                   // Fin de la query string
        size_t qlen = query_end - query_start;           // Calcule la longueur
        if (qlen >= ESP01_MAX_HTTP_QUERY_LEN)            // Vérifie la taille
            qlen = ESP01_MAX_HTTP_QUERY_LEN - 1;         // Tronque si nécessaire
        memcpy(parsed->query_string, query_start, qlen); // Copie la query string
        parsed->query_string[qlen] = '\0';               // Termine la chaîne
    }
    else
    {
        parsed->query_string[0] = '\0'; // Pas de query string
    }

