weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_HTTP.c
    parsed->is_valid = true;                                                                                      // Indique que le parsing est valide
    ESP01_LOG_DEBUG("HTTP", "Méthode=%s, Path=%s, Query=%s", parsed->method, parsed->path, parsed->query_string); // Log le résultat du parsing
    return ESP01_OK;                                                                                              // Retourne OK
}

// ==================== ENVOI DE RÉPONSES ====================

/**
 * @brief Envoie une réponse JSON sur la connexion spécifiée.
 * @param conn_id  Identifiant de connexion.
 * @param json     Chaîne JSON à envoyer.
 * @retval ESP01_Status_t Code de statut.
 */
ESP01_Status_t esp01_send_json_response(int conn_id, const char *json)
{
    ESP01_LOG_DEBUG("HTTP", "Envoi d'une réponse JSON sur connexion %d", conn_id);                        // Log l'envoi JSON
    return esp01_send_http_response(conn_id, ESP01_HTTP_OK_CODE, "application/json", json, strlen(json)); // Envoie la réponse HTTP avec le JSON
}

/**
 * @brief Envoie une réponse 404 Not Found sur la connexion spécifiée.
 * @param conn_id  Identifiant de connexion.
 * @retval ESP01_Status_t Code de statut.
 */
ESP01_Status_t esp01_send_404_response(int conn_id)
{
    ESP01_LOG_DEBUG("HTTP", "404 Not Found envoyé sur connexion %d", conn_id);                            // Log l'envoi 404
    const char *body = "<html><body><h1>404 Not Found</h1></body></html>";                                // Corps HTML pour la 404
    return esp01_send_http_response(conn_id, ESP01_HTTP_NOT_FOUND_CODE, "text/html", body, strlen(body)); // Envoie la réponse HTTP 404
}

/**
 * @brief Envoie une réponse HTTP complète (header + body).
 * @param conn_id      Identifiant de connexion.
 * @param status_code  Code HTTP (ex: 200, 404).
 * @param content_type Type MIME (ex: "text/html").
 * @param body         Corps de la réponse.
 * @param body_len     Taille du corps.
 * @retval ESP01_Status_t Code de statut.
 */
ESP01_Status_t esp01_send_http_response(int conn_id, int status_code, const char *content_type,
                                        const char *body, size_t body_len)
{
    ESP01_LOG_DEBUG("HTTP", "Préparation de la réponse HTTP (conn_id=%d, code=%d, type=%s, taille=%d)", conn_id, status_code, content_type ? content_type : "NULL", (int)body_len); // Log la préparation de la réponse
    VALIDATE_PARAM(conn_id >= 0, ESP01_FAIL);                                                                                                                                       // Vérifie l'identifiant de connexion
    VALIDATE_PARAM(status_code >= 100 && status_code < 600, ESP01_FAIL);                                                                                                            // Vérifie le code HTTP
    VALIDATE_PARAM(body || body_len == 0, ESP01_FAIL);                                                                                                                              // Vérifie le corps de la réponse

    uint32_t start = HAL_GetTick();                             // Timestamp de début pour les stats
    g_stats.total_requests++;                                   // Incrémente le nombre total de requêtes
    g_stats.response_count++;                                   // Incrémente le nombre de réponses envoyées
    if (status_code >= ESP01_HTTP_OK_CODE && status_code < 300) // Si code 2xx
        g_stats.successful_responses++;                         // Incrémente les réponses réussies
    else if (status_code >= 400)                                // Si code 4xx ou 5xx
        g_stats.failed_responses++;                             // Incrémente les réponses échouées

    char header[ESP01_MAX_HEADER_LINE]; // Buffer pour l'en-tête HTTP
    const char *status_text = "OK";     // Texte du statut HTTP
    switch (status_code)                // Sélectionne le texte selon le code
    {
    case ESP01_HTTP_OK_CODE:
        status_text = "OK"; // 200
        break;
    case ESP01_HTTP_NOT_FOUND_CODE:
        status_text = "Not Found"; // 404
        break;
    case ESP01_HTTP_INTERNAL_ERR_CODE:
        status_text = "Internal Server Error"; // 500
        break;
    case 204:
        status_text = "No Content"; // 204
        break;
    default:
        status_text = "Unknown"; // Autre
        break;
    }

    int header_len = snprintf(header, sizeof(header),
                              "HTTP/1.1 %d %s\r\n"
                              "Content-Type: %s\r\n"
                              "Content-Length: %d\r\n"
                              "Connection: close\r\n"
                              "\r\n",
                              status_code, status_text, content_type ? content_type : "text/html", (int)body_len); // Prépare l'en-tête HTTP

    char response[ESP01_MAX_TOTAL_HTTP];             // Buffer pour la réponse complète
    if ((header_len + body_len) >= sizeof(response)) // Vérifie la taille totale
    {
        ESP01_LOG_ERROR("HTTP", "Réponse HTTP trop grande (header=%d, body=%d, max=%d)", header_len, (int)body_len, (int)sizeof(response)); // Log l'erreur
        return ESP01_FAIL;                                                                                                                  // Retourne une erreur
    }

    memcpy(response, header, header_len);              // Copie l'en-tête dans le buffer
    if (body && body_len > 0)                          // Si un corps est présent
        memcpy(response + header_len, body, body_len); // Copie le corps dans le buffer

    int total_len = header_len + (int)body_len; // Calcule la taille totale

    char cipsend_cmd[ESP01_MAX_CIPSEND_BUF];                                            // Buffer pour la commande AT+CIPSEND
    snprintf(cipsend_cmd, sizeof(cipsend_cmd), "AT+CIPSEND=%d,%d", conn_id, total_len); // Prépare la commande AT+CIPSEND

    char resp[ESP01_MAX_RESP_BUF];                                                                            // Buffer pour la réponse AT
    ESP01_Status_t st = esp01_send_raw_command_dma(cipsend_cmd, resp, sizeof(resp), ">", ESP01_TIMEOUT_LONG); // Envoie la commande AT+CIPSEND
    if (st != ESP01_OK)                                                                                       // Vérifie le statut
    {
        ESP01_LOG_ERROR("HTTP", "AT+CIPSEND échoué pour la connexion %d", conn_id); // Log l'échec
        return st;                                                                  // Retourne l'erreur
    }

    HAL_UART_Transmit(g_esp_uart, (uint8_t *)response, total_len, HAL_MAX_DELAY); // Envoie la réponse HTTP sur l'UART

