weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_HTTP.c
    st = esp01_wait_for_pattern("SEND OK", ESP01_TIMEOUT_LONG);                                                                   // Attend la confirmation d'envoi
    ESP01_LOG_DEBUG("HTTP", "Réponse HTTP envoyée sur connexion %d, taille de la page HTML : %d octets", conn_id, (int)body_len); // Log la réussite

    uint32_t elapsed = HAL_GetTick() - start;                                                                              // Calcule le temps de réponse
    g_stats.total_response_time_ms += elapsed;                                                                             // Ajoute au temps total
    g_stats.avg_response_time_ms = g_stats.response_count ? (g_stats.total_response_time_ms / g_stats.response_count) : 0; // Met à jour la moyenne

    return st; // Retourne le statut
}

// ==================== GESTION DES CONNEXIONS ====================

/**
 * @brief Retourne le nombre de connexions TCP actives.
 * @retval Nombre de connexions actives.
 */
int esp01_get_active_connection_count(void)
{
    int count = 0;                                                       // Initialise le compteur
    for (int i = 0; i < ESP01_MAX_CONNECTIONS; ++i)                      // Parcours toutes les connexions
        if (g_connections[i].is_active)                                  // Si la connexion est active
            count++;                                                     // Incrémente le compteur
    ESP01_LOG_DEBUG("HTTP", "Nombre de connexions actives : %d", count); // Log le résultat
    return count;                                                        // Retourne le nombre de connexions actives
}

/**
 * @brief Vérifie si une connexion TCP est active.
 * @param conn_id  Identifiant de connexion.
 * @retval true si active, false sinon.
 */
bool esp01_is_connection_active(int conn_id)
{
    bool active = (conn_id >= 0 && conn_id < ESP01_MAX_CONNECTIONS && g_connections[conn_id].is_active); // Vérifie les bornes et l'état
    ESP01_LOG_DEBUG("HTTP", "Connexion %d active ? %s", conn_id, active ? "OUI" : "NON");                // Log le résultat
    return active;                                                                                       // Retourne l'état
}

/**
 * @brief Nettoie les connexions inactives (timeout).
 */
void esp01_cleanup_inactive_connections(void)
{
    uint32_t now = HAL_GetTick();                   // Récupère le temps courant
    for (int i = 0; i < ESP01_MAX_CONNECTIONS; ++i) // Parcours toutes les connexions
    {
        if (g_connections[i].is_active &&
            (now - g_connections[i].last_activity > ESP01_CONN_TIMEOUT_MS)) // Si la connexion est inactive depuis trop longtemps
        {
            ESP01_LOG_DEBUG("HTTP", "Connexion %d inactive depuis %lu ms, fermeture...", i, (unsigned long)(now - g_connections[i].last_activity)); // Log la fermeture
            esp01_http_close_connection(i);                                                                                                         // Ferme la connexion
            memset(&g_connections[i], 0, sizeof(connection_info_t));                                                                                // Réinitialise la structure
        }
        else if (!g_connections[i].is_active) // Si la connexion n'est pas active
        {
            memset(&g_connections[i], 0, sizeof(connection_info_t)); // Réinitialise la structure
        }
    }
}

/**
 * @brief Ferme une connexion TCP HTTP.
 * @param conn_id  Identifiant de connexion.
 * @retval ESP01_Status_t Code de statut.
 */
ESP01_Status_t esp01_http_close_connection(int conn_id)
{
    ESP01_LOG_DEBUG("HTTP", "Fermeture de la connexion %d", conn_id);                                   // Log la fermeture
    VALIDATE_PARAM(conn_id >= 0 && conn_id < ESP01_MAX_CONNECTIONS, ESP01_INVALID_PARAM);               // Vérifie l'identifiant
    char cmd[ESP01_MAX_CMD_BUF];                                                                        // Buffer pour la commande AT
    snprintf(cmd, sizeof(cmd), "AT+CIPCLOSE=%d", conn_id);                                              // Prépare la commande AT+CIPCLOSE
    char resp[ESP01_MAX_RESP_BUF];                                                                      // Buffer pour la réponse AT
    ESP01_Status_t st = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", ESP01_TIMEOUT_SHORT); // Envoie la commande AT
    if (st != ESP01_OK)                                                                                 // Vérifie le statut
        ESP01_RETURN_ERROR("HTTP_CLOSE", st);                                                           // Retourne une erreur si échec
    g_connections[conn_id].is_active = 0;                                                               // Marque la connexion comme inactive
    ESP01_LOG_INFO("HTTP", "Connexion %d fermée", conn_id);                                             // Log la réussite
    return ESP01_OK;                                                                                    // Retourne OK
}

/**
 * @brief Retourne l'adresse IP du client pour une connexion.
 * @param conn_id  Identifiant de connexion.
 * @retval Pointeur vers la chaîne IP, ou "N/A".
 */
const char *esp01_http_get_client_ip(int conn_id)
{
    if (conn_id < 0 || conn_id >= ESP01_MAX_CONNECTIONS)                                                    // Vérifie les bornes
        return "N/A";                                                                                       // Retourne "N/A" si hors bornes
    if (!g_connections[conn_id].is_active || !g_connections[conn_id].client_ip[0])                          // Vérifie l'état et la présence d'une IP
        return "N/A";                                                                                       // Retourne "N/A" si pas d'IP
    ESP01_LOG_DEBUG("HTTP", "IP client pour connexion %d : %s", conn_id, g_connections[conn_id].client_ip); // Log l'IP
    return g_connections[conn_id].client_ip;                                                                // Retourne l'IP
}

/**
 * @brief Affiche l'état des connexions actives (log debug).
 */
void esp01_print_connection_status(void)
{
    for (int i = 0; i < ESP01_MAX_CONNECTIONS; ++i) // Parcours toutes les connexions
    {
        if (g_connections[i].is_active)                                                            // Si la connexion est active
            ESP01_LOG_INFO("HTTP", "Connexion %d active, IP : %s", i, g_connections[i].client_ip); // Log l'état de la connexion
    }
}

// ==================== TRAITEMENT AUTOMATIQUE DES REQUÊTES ====================

/**
 * @brief Traite automatiquement les requêtes HTTP reçues (DMA accumulateur).
 */
void esp01_process_requests(void)
{
    if (g_processing_request) // Si un traitement est déjà en cours
        return;               // Sort sans rien faire

    g_processing_request = 1; // Marque le début du traitement

