weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_HTTP.c
    // --- Lecture UART automatique (DMA accumulateur) ---
    uint8_t buffer[ESP01_DMA_RX_BUF_SIZE];                     // Buffer temporaire pour la lecture UART
    uint16_t len = esp01_get_new_data(buffer, sizeof(buffer)); // Récupère les nouveaux octets reçus
    if (len > 0)                                               // Si des données ont été reçues
    {
        if ((g_acc_len + len) < (int)sizeof(g_accumulator) - 1) // Vérifie qu'il reste de la place dans l'accumulateur
        {
            memcpy(g_accumulator + g_acc_len, buffer, len);                                               // Ajoute les données à l'accumulateur
            g_acc_len += len;                                                                             // Met à jour la longueur totale
            g_accumulator[g_acc_len] = '\0';                                                              // Termine la chaîne
            ESP01_LOG_DEBUG("HTTP", "Ajout de %d octets dans l'accumulateur (total=%d)", len, g_acc_len); // Log l'ajout
        }
        else
        {
            ESP01_LOG_ERROR("HTTP", "Dépassement du buffer accumulateur HTTP (g_acc_len=%d, len=%d)", g_acc_len, len); // Log le dépassement
            g_acc_len = 0;                                                                                             // Réinitialise la longueur
            g_accumulator[0] = '\0';                                                                                   // Vide le buffer
        }
    }

    // --- Traitement des paquets +IPD ---
    char *ipd_ptr = _find_next_ipd(g_accumulator, g_acc_len); // Recherche le prochain +IPD dans l'accumulateur
    while (ipd_ptr)                                           // Tant qu'un +IPD est trouvé
    {
        http_request_t ipd = parse_ipd_header(ipd_ptr); // Parse l'en-tête +IPD
        if (ipd.is_valid)                               // Si le parsing est valide
        {
            // --- MISE À JOUR DE LA CONNEXION ---
            connection_info_t *conn = &g_connections[ipd.conn_id];                          // Récupère la structure de connexion
            conn->conn_id = ipd.conn_id;                                                    // Met à jour l'identifiant
            conn->is_active = true;                                                         // Marque la connexion comme active
            conn->last_activity = HAL_GetTick();                                            // Met à jour le timestamp d'activité
            if (ipd.has_ip)                                                                 // Si l'IP est présente
                esp01_safe_strcpy(conn->client_ip, sizeof(conn->client_ip), ipd.client_ip); // Copie l'IP
            else
                conn->client_ip[0] = 0;          // Vide la chaîne IP
            conn->client_port = ipd.client_port; // Met à jour le port client
            // --- FIN MISE À JOUR ---

            char *data_start = strchr(ipd_ptr, ':');                                                // Recherche le début des données HTTP
            if (data_start && (g_acc_len - (data_start - g_accumulator) - 1) >= ipd.content_length) // Vérifie que toutes les données sont présentes
            {
                data_start++;                                     // Passe le ':'
                char http_buf[ESP01_MAX_TOTAL_HTTP] = {0};        // Buffer pour la requête HTTP brute
                memcpy(http_buf, data_start, ipd.content_length); // Copie la requête HTTP
                http_buf[ipd.content_length] = 0;                 // Termine la chaîne

                ESP01_LOG_DEBUG("HTTP", "IPD reçu (brut) :\n%s", http_buf); // Log la requête brute

                http_parsed_request_t req;                                                // Structure pour la requête parsée
                if (esp01_parse_http_request(http_buf, &req) == ESP01_OK && req.is_valid) // Parse la requête HTTP
                {
                    if (strcmp(req.path, "/favicon.ico") == 0) // Si la requête concerne favicon.ico
                    {
                        ESP01_LOG_DEBUG("HTTP", "favicon.ico demandé, réponse 204 No Content"); // Log la détection
                        esp01_send_http_response(ipd.conn_id, 204, "image/x-icon", NULL, 0);    // Répond avec 204 No Content
                        goto cleanup;                                                           // Passe au nettoyage
                    }

                    ESP01_LOG_DEBUG("HTTP", "Appel du handler pour la route : %s", req.path); // Log l'appel du handler
                    esp01_route_handler_t handler = esp01_find_route_handler(req.path);       // Recherche le handler pour la route
                    if (handler)                                                              // Si un handler est trouvé
                        handler(ipd.conn_id, &req);                                           // Appelle le handler
                    else
                        esp01_send_404_response(ipd.conn_id); // Sinon, envoie une 404
                }
                else
                {
                    ESP01_LOG_DEBUG("HTTP", "Parsing HTTP échoué, envoi d'une 404"); // Log l'échec du parsing
                    esp01_send_404_response(ipd.conn_id);                            // Envoie une 404
                }

            cleanup:
                int to_remove = (data_start - g_accumulator) + ipd.content_length;        // Calcule le nombre d'octets à retirer de l'accumulateur
                memmove(g_accumulator, g_accumulator + to_remove, g_acc_len - to_remove); // Décale le buffer pour supprimer la requête traitée
                g_acc_len -= to_remove;                                                   // Met à jour la longueur de l'accumulateur
                ipd_ptr = _find_next_ipd(g_accumulator, g_acc_len);                       // Recherche le prochain +IPD
                continue;                                                                 // Passe à la prochaine itération
            }
        }
        break; // Sort de la boucle si pas de +IPD complet
    }

    g_processing_request = 0; // Marque la fin du traitement
}

/**
 * @brief Boucle principale HTTP à appeler périodiquement (traitement + nettoyage).
 */
void esp01_http_loop(void)
{
    esp01_process_requests();             // Traite les requêtes HTTP reçues
    esp01_cleanup_inactive_connections(); // Nettoie les connexions inactives
}

// ==================== OUTILS GENERAUX ====================

/**
 * @brief Vide le payload HTTP restant dans l'uart (lecture forcée).
 * @param expected_length  Nombre d'octets à lire/ignorer.
 */
void discard_http_payload(int expected_length)
{
    ESP01_LOG_DEBUG("HTTP", "discard_http_payload: début vidage payload HTTP (%d octets)", expected_length); // Log le début du vidage
    char discard_buf[ESP01_SMALL_BUF_SIZE];                                                                  // Buffer temporaire pour la lecture
    int remaining = expected_length;                                                                         // Nombre d'octets restant à lire
    uint32_t timeout_start = HAL_GetTick();                                                                  // Timestamp de début
    const uint32_t timeout_ms = 200;                                                                         // Timeout maximal

    while (remaining > 0 && (HAL_GetTick() - timeout_start) < timeout_ms) // Boucle jusqu'à avoir tout lu ou timeout
    {
        int to_read = (remaining > sizeof(discard_buf)) ? sizeof(discard_buf) : remaining; // Calcule le nombre d'octets à lire
        int read = esp01_get_new_data((uint8_t *)discard_buf, to_read);                    // Lit les nouveaux octets reçus
        if (read > 0)                                                                      // Si des octets ont été lus
        {
            remaining -= read;             // Décrémente le nombre restant
            timeout_start = HAL_GetTick(); // Réinitialise le timeout
        }
        else
        {
            HAL_Delay(2); // Petite pause si rien reçu
        }
    }

    if (remaining > 0) // Si tous les octets n'ont pas été lus
    {
        ESP01_LOG_WARN("HTTP", "discard_http_payload: %d octets non lus (discard incomplet)", remaining); // Log l'avertissement
    }
}

/**
 * @brief  Récupère le statut du serveur HTTP
 * @param  is_server Pointeur vers variable indiquant si le serveur est en cours d'exécution
 * @param  port      Pointeur vers variable stockant le port du serveur
 * @retval ESP01_Status_t ESP01_OK en cas de succès ou code d'erreur
 * @note   Cette fonction vérifie l'état du serveur via AT+CIPSTATUS et retourne le port configuré
 * @details
 *         La fonction envoie AT+CIPSTATUS pour vérifier l'état des connexions.
 *         Si "STATUS:" est trouvé dans la réponse, le serveur est considéré comme actif.
 *         Le port est récupéré depuis la variable globale g_server_port.
 */
ESP01_Status_t esp01_http_get_server_status(uint8_t *is_server, uint16_t *port)
{
    VALIDATE_PARAM(is_server && port, ESP01_INVALID_PARAM);

    char resp[ESP01_MAX_RESP_BUF] = {0};

    // Vérifier l'état de la connexion
    ESP01_Status_t st = esp01_send_raw_command_dma("AT+CIPSTATUS", resp, sizeof(resp), "OK", ESP01_TIMEOUT_SHORT);
    if (st != ESP01_OK)
    {
        ESP01_RETURN_ERROR("HTTP_STATUS", st);
    }

    // Le serveur est considéré actif si nous avons un statut de connexion
    // Cette logique peut être adaptée selon les besoins exacts
    char *status_str = strstr(resp, "STATUS:");
    *is_server = (status_str != NULL) ? 1 : 0;

    // Récupérer le port configuré (variable globale)
    *port = g_server_port;

    ESP01_LOG_INFO("HTTP", "Statut serveur: %s (port %u)",
                   *is_server ? "Actif" : "Inactif", *port);

    return ESP01_OK;
} // Fin de esp01_http_get_server_status
